src/cf/InformationRegisters/ктв_ИспользованиеИменЛогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ктв_ИспользованиеИменЛогов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СпособЛогирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ктв_СпособыЛогирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЛога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ктв_ИспользованиеИменЛогов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
// Процедура - обработчик события ПриСозданииНаСервере
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяЛога = Запись.ИмяЛога;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события ПередЗаписью
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Запись.ИмяЛога = ИмяЛога;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события НачалоВыбора поля ИмяЛога
//
&НаКлиенте
Процедура ИмяЛогаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Исключения = ПолучитьСписокИсключенийИменЛогов(Запись.СпособЛогирования, Запись.ИмяЛога);
	
	ВремСписокВыбора = Новый СписокЗначений();
	ВремСписокВыбора.ЗагрузитьЗначения(ктв_ЛогированиеВызовСервера.ПолучитьИменаЛогов(Исключения));
	
	ОбработкаВыбораИзСписка = Новый ОписаниеОповещения("ИмяЛогаНачалоВыбораЗавершение", ЭтаФорма);
	
	ПоказатьВыборИзСписка(ОбработкаВыбораИзСписка, ВремСписокВыбора, Элементы.ИмяЛога);
	
КонецПроцедуры // ИмяЛогаНачалоВыбора()

// Процедура - продолжение обработчика события НачалоВыбора поля ИмяЛога
//
&НаКлиенте
Процедура ИмяЛогаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЛога = ВыбранныйЭлемент.Значение;
	
КонецПроцедуры // ИмяЛогаНачалоВыбораЗавершение()

// Функция - получает список имен логов недоступных для выбора
//
// Параметры:
//	СпособЛогирования		- СправочникСсылка.			- способ логирования, для которого получаем исключения
//							  ктв_СпособыЛогирования
//	ТекущееЗначение			- Строка					- имя лога, которое не нужно исключать
//
// Возвращаемое значение:
//	Массив (Строка)			- массив исключаемых имен логов
//
&НаСервереБезКонтекста
Функция ПолучитьСписокИсключенийИменЛогов(СпособЛогирования, ТекущееЗначение = Неопределено)

	НаборЗаписей = РегистрыСведений.ктв_ИспользованиеИменЛогов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СпособЛогирования.Установить(СпособЛогирования);
	НаборЗаписей.Прочитать();
	
	Исключения = Новый Массив();
	
	Для Каждого ТекЗапись Из НаборЗаписей Цикл
		Если ПустаяСтрока(ТекЗапись.ИмяЛога) Тогда
			Продолжить;
		КонецЕсли;
		Если ТекущееЗначение = ТекЗапись.ИмяЛога Тогда
			Продолжить;
		КонецЕсли;
		Исключения.Добавить(ТекЗапись.ИмяЛога);
	КонецЦикла;
	
	Возврат Исключения;
	
КонецФункции // ПолучитьСписокИсключенийИменЛогов()
